lib/spree_avatax_certified/templates/ping.erb

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://avatax.avalara.com/services">
   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-7" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username><%= @username %></wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%= @password %></wsse:Password>
         </wsse:UsernameToken>
      </wsse:Security>
      <ser:Profile>
         <ser:Name><%= @name %></ser:Name>
         <ser:Client><%= @clientname %></ser:Client>
         <ser:Adapter><%= @adapter %></ser:Adapter>
         <ser:Machine><%= @machine %></ser:Machine>
      </ser:Profile>
   </soapenv:Header>
   <soapenv:Body>
      <ser:Ping>
         <ser:Message><%= @ping_message %></ser:Message>
      </ser:Ping>
   </soapenv:Body>
</soapenv:Envelope>