Avatax_AddressService/lib/template_validate.erb

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://avatax.avalara.com/services">
   <soapenv:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-7" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username><%= @username %></wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%= @password %></wsse:Password>
            <wsu:Created>2012-03-02T23:41:44.511Z</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
      <ser:Profile>
         <ser:Name><%= @name %></ser:Name>
         <ser:Client><%= @clientname %></ser:Client>
         <ser:Adapter><%= @adapter %></ser:Adapter>
         <ser:Machine><%= @machine %></ser:Machine>
      </ser:Profile>
   </soapenv:Header>
   <soapenv:Body>
      <ser:Validate>
         <ser:ValidateRequest>
            <ser:Address>
               <ser:AddressCode><%= @addresscode %></ser:AddressCode>
               <ser:Line1><%= @line1 %></ser:Line1>
               <ser:Line2><%= @line2 %></ser:Line2>
               <ser:Line3><%= @line3 %></ser:Line3>
               <ser:City><%= @city %></ser:City>
               <ser:Region><%= @region %></ser:Region>
               <ser:PostalCode><%= @postalcode %></ser:PostalCode>
               <ser:Country><%= @country %></ser:Country>
               <ser:TaxRegionId><%= @taxregionid %></ser:TaxRegionId>
               <ser:Latitude><%= @latitude %></ser:Latitude>
               <ser:Longitude><%= @longitude %></ser:Longitude>
            </ser:Address>
            <ser:TextCase><%= @textcase %></ser:TextCase>
            <ser:Coordinates><%= @coordinates %></ser:Coordinates>
            <ser:Taxability><%= @taxability %></ser:Taxability>
            <ser:Date>1900-01-01</ser:Date>
         </ser:ValidateRequest>
      </ser:Validate>
   </soapenv:Body>
  </soapenv:Envelope>